tiborsimon/embedded-tdd-headers/pic/8bit/pic12f1572_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12F1572_H_
#define _PIC12F1572_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PIR1                          42
#define TMR1IF                        43
#define TMR2IF                        44
#define TXIF                          45
#define RCIF                          46
#define ADIF                          47
#define TMR1GIF                       48
#define PIR2                          49
#define C1IF                          50
#define PIR3                          51
#define PWM1IF                        52
#define PWM2IF                        53
#define PWM3IF                        54
#define TMR0                          55
#define TMR1L                         56
#define TMR1H                         57
#define T1CON                         58
#define TMR1ON                        59
#define nT1SYNC                       60
#define T1CKPS0                       61
#define T1CKPS                        62
#define T1CKPS1                       63
#define TMR1CS                        64
#define TMR1CS0                       65
#define TMR1CS1                       66
#define T1GCON                        67
#define T1GSS0                        68
#define T1GSS                         69
#define T1GSS1                        70
#define T1GVAL                        71
#define T1GGO_nDONE                   72
#define T1GGO                         73
#define T1GSPM                        74
#define T1GTM                         75
#define T1GPOL                        76
#define TMR1GE                        77
#define TMR2                          78
#define PR2                           79
#define T2CON                         80
#define T2CKPS0                       81
#define T2CKPS                        82
#define T2CKPS1                       83
#define TMR2ON                        84
#define T2OUTPS0                      85
#define T2OUTPS                       86
#define T2OUTPS1                      87
#define T2OUTPS2                      88
#define T2OUTPS3                      89
#define TRISA                         90
#define TRISA0                        91
#define TRISA1                        92
#define TRISA2                        93
#define TRISA3                        94
#define TRISA4                        95
#define TRISA5                        96
#define PIE1                          97
#define TMR1IE                        98
#define TMR2IE                        99
#define TXIE                          100
#define RCIE                          101
#define ADIE                          102
#define TMR1GIE                       103
#define PIE2                          104
#define C1IE                          105
#define PIE3                          106
#define PWM1IE                        107
#define PWM2IE                        108
#define PWM3IE                        109
#define OPTION_REG                    110
#define OPTION_REG_PS                 111
#define OPTION_REG_PS0                112
#define OPTION_REG_PS1                113
#define OPTION_REG_PS2                114
#define PSA                           115
#define T0SE                          116
#define TMR0SE                        117
#define T0CS                          118
#define TMR0CS                        119
#define INTEDG                        120
#define nWPUEN                        121
#define PCON                          122
#define nBOR                          123
#define nPOR                          124
#define nRI                           125
#define nRMCLR                        126
#define nRWDT                         127
#define STKUNF                        128
#define STKOVF                        129
#define WDTCON                        130
#define SWDTEN                        131
#define WDTPS                         132
#define WDTPS0                        133
#define WDTPS1                        134
#define WDTPS2                        135
#define WDTPS3                        136
#define WDTPS4                        137
#define OSCTUNE                       138
#define TUN0                          139
#define TUN                           140
#define TUN1                          141
#define TUN2                          142
#define TUN3                          143
#define TUN4                          144
#define TUN5                          145
#define OSCCON                        146
#define SCS0                          147
#define SCS                           148
#define SCS1                          149
#define IRCF                          150
#define IRCF0                         151
#define IRCF1                         152
#define IRCF2                         153
#define IRCF3                         154
#define SPLLEN                        155
#define OSCSTAT                       156
#define HFIOFS                        157
#define LFIOFR                        158
#define MFIOFR                        159
#define HFIOFL                        160
#define HFIOFR                        161
#define OSTS                          162
#define PLLR                          163
#define ADRESL                        164
#define ADRESH                        165
#define ADCON0                        166
#define ADON                          167
#define nDONE                         168
#define GO_nDONE                      169
#define GO                            170
#define ADGO                          171
#define CHS0                          172
#define CHS                           173
#define CHS1                          174
#define CHS2                          175
#define CHS3                          176
#define CHS4                          177
#define ADCON1                        178
#define ADPREF0                       179
#define ADPREF                        180
#define ADPREF1                       181
#define ADCS0                         182
#define ADCS                          183
#define ADCS1                         184
#define ADCS2                         185
#define ADFM                          186
#define ADCON2                        187
#define TRIGSEL0                      188
#define TRIGSEL                       189
#define TRIGSEL1                      190
#define TRIGSEL2                      191
#define TRIGSEL3                      192
#define LATA0                         193
#define LATA                          194
#define LATA1                         195
#define LATA2                         196
#define LATA4                         197
#define LATA5                         198
#define CM1CON0                       199
#define C1SYNC                        200
#define C1HYS                         201
#define C1SP                          202
#define C1POL                         203
#define C1OE                          204
#define C1OUT                         205
#define C1ON                          206
#define CM1CON1                       207
#define C1NCH0                        208
#define C1NCH                         209
#define C1NCH1                        210
#define C1NCH2                        211
#define C1PCH                         212
#define C1PCH0                        213
#define C1PCH1                        214
#define C1INTN                        215
#define C1INTP                        216
#define CMOUT                         217
#define MC1OUT                        218
#define BORCON                        219
#define BORRDY                        220
#define BORFS                         221
#define SBOREN                        222
#define FVRCON                        223
#define ADFVR0                        224
#define ADFVR                         225
#define ADFVR1                        226
#define CDAFVR0                       227
#define CDAFVR                        228
#define CDAFVR1                       229
#define TSRNG                         230
#define TSEN                          231
#define FVRRDY                        232
#define FVREN                         233
#define DACCON0                       234
#define DACPSS                        235
#define DACPSS0                       236
#define DACPSS1                       237
#define DACOE                         238
#define DACLPS                        239
#define DACEN                         240
#define DACCON1                       241
#define DACR0                         242
#define DACR                          243
#define DACR1                         244
#define DACR2                         245
#define DACR3                         246
#define DACR4                         247
#define APFCON                        248
#define P1SEL                         249
#define P2SEL                         250
#define TXCKSEL                       251
#define T1GSEL                        252
#define CWGBSEL                       253
#define CWGASEL                       254
#define RXDTSEL                       255
#define ANSA0                         256
#define ANSELA                        257
#define ANSA1                         258
#define ANSA2                         259
#define ANSA4                         260
#define PMADRL                        261
#define PMADRH                        262
#define PMDATL                        263
#define PMDATH                        264
#define PMCON1                        265
#define RD                            266
#define WR                            267
#define WREN                          268
#define WRERR                         269
#define FREE                          270
#define LWLO                          271
#define CFGS                          272
#define PMCON2                        273
#define VREGCON                       274
#define VREGPM                        275
#define RCREG                         276
#define TXREG                         277
#define SPBRGL                        278
#define SPBRGH                        279
#define RCSTA                         280
#define RX9D                          281
#define OERR                          282
#define FERR                          283
#define ADDEN                         284
#define CREN                          285
#define SREN                          286
#define RX9                           287
#define SPEN                          288
#define TXSTA                         289
#define TX9D                          290
#define TRMT                          291
#define BRGH                          292
#define SENDB                         293
#define SYNC                          294
#define TXEN                          295
#define TX9                           296
#define CSRC                          297
#define BAUDCON                       298
#define ABDEN                         299
#define WUE                           300
#define BRG16                         301
#define SCKP                          302
#define RCIDL                         303
#define ABDOVF                        304
#define WPUA0                         305
#define WPUA                          306
#define WPUA1                         307
#define WPUA2                         308
#define WPUA3                         309
#define WPUA4                         310
#define WPUA5                         311
#define ODCONA                        312
#define ODA                           313
#define ODA0                          314
#define ODA1                          315
#define ODA2                          316
#define ODA4                          317
#define ODA5                          318
#define SLRCONA                       319
#define SLRA                          320
#define SLRA0                         321
#define SLRA1                         322
#define SLRA2                         323
#define SLRA4                         324
#define SLRA5                         325
#define INLVLA                        326
#define INLVLA0                       327
#define INLVLA1                       328
#define INLVLA2                       329
#define INLVLA3                       330
#define INLVLA4                       331
#define INLVLA5                       332
#define IOCAP                         333
#define IOCAP0                        334
#define IOCAP1                        335
#define IOCAP2                        336
#define IOCAP3                        337
#define IOCAP4                        338
#define IOCAP5                        339
#define IOCAN0                        340
#define IOCAN                         341
#define IOCAN1                        342
#define IOCAN2                        343
#define IOCAN3                        344
#define IOCAN4                        345
#define IOCAN5                        346
#define IOCAF0                        347
#define IOCAF                         348
#define IOCAF1                        349
#define IOCAF2                        350
#define IOCAF3                        351
#define IOCAF4                        352
#define IOCAF5                        353
#define CWG1DBR0                      354
#define CWG1DBR                       355
#define CWG1DBR1                      356
#define CWG1DBR2                      357
#define CWG1DBR3                      358
#define CWG1DBR4                      359
#define CWG1DBR5                      360
#define CWG1DBF                       361
#define CWG1DBF0                      362
#define CWG1DBF1                      363
#define CWG1DBF2                      364
#define CWG1DBF3                      365
#define CWG1DBF4                      366
#define CWG1DBF5                      367
#define CWG1CON0                      368
#define G1CS0                         369
#define G1CS                          370
#define G1POLA                        371
#define G1POLB                        372
#define G1OEA                         373
#define G1OEB                         374
#define G1EN                          375
#define CWG1CON1                      376
#define G1IS0                         377
#define G1IS                          378
#define G1IS1                         379
#define G1IS2                         380
#define G1ASDLA                       381
#define G1ASDLA0                      382
#define G1ASDLA1                      383
#define G1ASDLB                       384
#define G1ASDLB0                      385
#define G1ASDLB1                      386
#define CWG1CON2                      387
#define G1ASDSFLT                     388
#define G1ASDSC1                      389
#define G1ARSEN                       390
#define G1ASE                         391
#define PWMEN                         392
#define MPWM1EN                       393
#define PWM1EN_A                      394
#define MPWM2EN                       395
#define PWM2EN_A                      396
#define MPWM3EN                       397
#define PWM3EN_A                      398
#define PWMLD                         399
#define MPWM1LD                       400
#define PWM1LDA_A                     401
#define MPWM2LD                       402
#define PWM2LDA_A                     403
#define PWM3LDA_A                     404
#define MPWM3LD                       405
#define PWMOUT                        406
#define PWM1OUT_A                     407
#define MPWM1OUT                      408
#define MPWM2OUT                      409
#define PWM2OUT_A                     410
#define MPWM3OUT                      411
#define PWM3OUT_A                     412
#define PWM1PHL                       413
#define PWM1PHL0                      414
#define PWM1PHL_PH                    415
#define PWM1PHL1                      416
#define PWM1PHL2                      417
#define PWM1PHL3                      418
#define PWM1PHL4                      419
#define PWM1PHL5                      420
#define PWM1PHL6                      421
#define PWM1PHL7                      422
#define PWM1PHH                       423
#define PWM1PHH0                      424
#define PWM1PHH_PH                    425
#define PWM1PHH1                      426
#define PWM1PHH2                      427
#define PWM1PHH3                      428
#define PWM1PHH4                      429
#define PWM1PHH5                      430
#define PWM1PHH6                      431
#define PWM1PHH7                      432
#define PWM1DCL_DC                    433
#define PWM1DCL                       434
#define PWM1DCL0                      435
#define PWM1DCL1                      436
#define PWM1DCL2                      437
#define PWM1DCL3                      438
#define PWM1DCL4                      439
#define PWM1DCL5                      440
#define PWM1DCL6                      441
#define PWM1DCL7                      442
#define PWM1DCH_DC                    443
#define PWM1DCH                       444
#define PWM1DCH0                      445
#define PWM1DCH1                      446
#define PWM1DCH2                      447
#define PWM1DCH3                      448
#define PWM1DCH4                      449
#define PWM1DCH5                      450
#define PWM1DCH6                      451
#define PWM1DCH7                      452
#define PWM1PRL                       453
#define PWM1PRL0                      454
#define PWM1PRL_PR                    455
#define PWM1PRL1                      456
#define PWM1PRL2                      457
#define PWM1PRL3                      458
#define PWM1PRL4                      459
#define PWM1PRL5                      460
#define PWM1PRL6                      461
#define PWM1PRL7                      462
#define PWM1PRH                       463
#define PWM1PRH_PR                    464
#define PWM1PRH0                      465
#define PWM1PRH1                      466
#define PWM1PRH2                      467
#define PWM1PRH3                      468
#define PWM1PRH4                      469
#define PWM1PRH5                      470
#define PWM1PRH6                      471
#define PWM1PRH7                      472
#define PWM1OFL0                      473
#define PWM1OFL_OF                    474
#define PWM1OFL                       475
#define PWM1OFL1                      476
#define PWM1OFL2                      477
#define PWM1OFL3                      478
#define PWM1OFL4                      479
#define PWM1OFL5                      480
#define PWM1OFL6                      481
#define PWM1OFL7                      482
#define PWM1OFH_OF                    483
#define PWM1OFH                       484
#define PWM1OFH0                      485
#define PWM1OFH1                      486
#define PWM1OFH2                      487
#define PWM1OFH3                      488
#define PWM1OFH4                      489
#define PWM1OFH5                      490
#define PWM1OFH6                      491
#define PWM1OFH7                      492
#define PWM1TMRL0                     493
#define PWM1TMRL_TMR                  494
#define PWM1TMRL                      495
#define PWM1TMRL1                     496
#define PWM1TMRL2                     497
#define PWM1TMRL3                     498
#define PWM1TMRL4                     499
#define PWM1TMRL5                     500
#define PWM1TMRL6                     501
#define PWM1TMRL7                     502
#define PWM1TMRH                      503
#define PWM1TMRH0                     504
#define PWM1TMRH_TMR                  505
#define PWM1TMRH1                     506
#define PWM1TMRH2                     507
#define PWM1TMRH3                     508
#define PWM1TMRH4                     509
#define PWM1TMRH5                     510
#define PWM1TMRH6                     511
#define PWM1TMRH7                     512
#define PWM1CON                       513
#define PWM1CON_MODE                  514
#define PWM1MODE0                     515
#define PWM1MODE                      516
#define PWM1CON_MODE0                 517
#define PWM1MODE1                     518
#define PWM1CON_MODE1                 519
#define PWM1CON_POL                   520
#define PWM1POL                       521
