tiborsimon/embedded-tdd-headers/pic/8bit/pic12f1572_tdd.h
#define PWM1CON_OUT                   522
#define PWM1OUT                       523
#define PWM1OE                        524
#define PWM1CON_OE                    525
#define PWM1EN                        526
#define PWM1CON_EN                    527
#define PWM1INTE                      528
#define PWM1PRIE                      529
#define PWM1INTE_PRIE                 530
#define PWM1DCIE                      531
#define PWM1INTE_DCIE                 532
#define PWM1INTE_PHIE                 533
#define PWM1PHIE                      534
#define PWM1OFIE                      535
#define PWM1INTE_OFIE                 536
#define PWM1INTF                      537
#define PWM1INTF_PRIF                 538
#define PWM1PRIF                      539
#define PWM1INTF_DCIF                 540
#define PWM1DCIF                      541
#define PWM1PHIF                      542
#define PWM1INTF_PHIF                 543
#define PWM1OFIF                      544
#define PWM1INTF_OFIF                 545
#define PWM1CLKCON                    546
#define PWM1CLKCON_CS                 547
#define PWM1CS                        548
#define PWM1CLKCON_CS0                549
#define PWM1CS0                       550
#define PWM1CLKCON_CS1                551
#define PWM1CS1                       552
#define PWM1CLKCON_PS0                553
#define PWM1PS                        554
#define PWM1PS0                       555
#define PWM1CLKCON_PS                 556
#define PWM1PS1                       557
#define PWM1CLKCON_PS1                558
#define PWM1PS2                       559
#define PWM1CLKCON_PS2                560
#define PWM1LDCON                     561
#define PWM1LDCON_LDS0                562
#define PWM1LDS                       563
#define PWM1LDCON_LDS                 564
#define PWM1LDS0                      565
#define PWM1LDCON_LDS1                566
#define PWM1LDS1                      567
#define PWM1LDCON_LDT                 568
#define PWM1LDM                       569
#define PWM1LD                        570
#define PWM1LDCON_LDA                 571
#define PWM1OFCON                     572
#define PWM1OFCON_OFS0                573
#define PWM1OFS                       574
#define PWM1OFCON_OFS                 575
#define PWM1OFS0                      576
#define PWM1OFCON_OFS1                577
#define PWM1OFS1                      578
#define PWM1OFMC                      579
#define PWM1OFCON_OFO                 580
#define PWM1OFM0                      581
#define PWM1OFM                       582
#define PWM1OFCON_OFM0                583
#define PWM1OFCON_OFM                 584
#define PWM1OFM1                      585
#define PWM1OFCON_OFM1                586
#define PWM2PHL_PH                    587
#define PWM2PHL0                      588
#define PWM2PHL                       589
#define PWM2PHL1                      590
#define PWM2PHL2                      591
#define PWM2PHL3                      592
#define PWM2PHL4                      593
#define PWM2PHL5                      594
#define PWM2PHL6                      595
#define PWM2PHL7                      596
#define PWM2PHH0                      597
#define PWM2PHH                       598
#define PWM2PHH_PH                    599
#define PWM2PHH1                      600
#define PWM2PHH2                      601
#define PWM2PHH3                      602
#define PWM2PHH4                      603
#define PWM2PHH5                      604
#define PWM2PHH6                      605
#define PWM2PHH7                      606
#define PWM2DCL_DC                    607
#define PWM2DCL0                      608
#define PWM2DCL                       609
#define PWM2DCL1                      610
#define PWM2DCL2                      611
#define PWM2DCL3                      612
#define PWM2DCL4                      613
#define PWM2DCL5                      614
#define PWM2DCL6                      615
#define PWM2DCL7                      616
#define PWM2DCH0                      617
#define PWM2DCH_DC                    618
#define PWM2DCH                       619
#define PWM2DCH1                      620
#define PWM2DCH2                      621
#define PWM2DCH3                      622
#define PWM2DCH4                      623
#define PWM2DCH5                      624
#define PWM2DCH6                      625
#define PWM2DCH7                      626
#define PWM2PRL0                      627
#define PWM2PRL_PR                    628
#define PWM2PRL                       629
#define PWM2PRL1                      630
#define PWM2PRL2                      631
#define PWM2PRL3                      632
#define PWM2PRL4                      633
#define PWM2PRL5                      634
#define PWM2PRL6                      635
#define PWM2PRL7                      636
#define PWM2PRH0                      637
#define PWM2PRH                       638
#define PWM2PRH_PR                    639
#define PWM2PRH1                      640
#define PWM2PRH2                      641
#define PWM2PRH3                      642
#define PWM2PRH4                      643
#define PWM2PRH5                      644
#define PWM2PRH6                      645
#define PWM2PRH7                      646
#define PWM2OFL                       647
#define PWM2OFL_OF                    648
#define PWM2OFL0                      649
#define PWM2OFL1                      650
#define PWM2OFL2                      651
#define PWM2OFL3                      652
#define PWM2OFL4                      653
#define PWM2OFL5                      654
#define PWM2OFL6                      655
#define PWM2OFL7                      656
#define PWM2OFH                       657
#define PWM2OFH0                      658
#define PWM2OFH_OF                    659
#define PWM2OFH1                      660
#define PWM2OFH2                      661
#define PWM2OFH3                      662
#define PWM2OFH4                      663
#define PWM2OFH5                      664
#define PWM2OFH6                      665
#define PWM2OFH7                      666
#define PWM2TMRL_TMR                  667
#define PWM2TMRL0                     668
#define PWM2TMRL                      669
#define PWM2TMRL1                     670
#define PWM2TMRL2                     671
#define PWM2TMRL3                     672
#define PWM2TMRL4                     673
#define PWM2TMRL5                     674
#define PWM2TMRL6                     675
#define PWM2TMRL7                     676
#define PWM2TMRH_TMR                  677
#define PWM2TMRH                      678
#define PWM2TMRH0                     679
#define PWM2TMRH1                     680
#define PWM2TMRH2                     681
#define PWM2TMRH3                     682
#define PWM2TMRH4                     683
#define PWM2TMRH5                     684
#define PWM2TMRH6                     685
#define PWM2TMRH7                     686
#define PWM2CON                       687
#define PWM2MODE0                     688
#define PWM2MODE                      689
#define PWM2CON_MODE0                 690
#define PWM2CON_MODE                  691
#define PWM2MODE1                     692
#define PWM2CON_MODE1                 693
#define PWM2POL                       694
#define PWM2CON_POL                   695
#define PWM2CON_OUT                   696
#define PWM2OUT                       697
#define PWM2OE                        698
#define PWM2CON_OE                    699
#define PWM2EN                        700
#define PWM2CON_EN                    701
#define PWM2INTE                      702
#define PWM2INTE_PRIE                 703
#define PWM2PRIE                      704
#define PWM2INTE_DCIE                 705
#define PWM2DCIE                      706
#define PWM2INTE_PHIE                 707
#define PWM2PHIE                      708
#define PWM2INTE_OFIE                 709
#define PWM2OFIE                      710
#define PWM2INTF                      711
#define PWM2INTF_PRIF                 712
#define PWM2PRIF                      713
#define PWM2INTF_DCIF                 714
#define PWM2DCIF                      715
#define PWM2INTF_PHIF                 716
#define PWM2PHIF                      717
#define PWM2INTF_OFIF                 718
#define PWM2OFIF                      719
#define PWM2CLKCON                    720
#define PWM2CS0                       721
#define PWM2CS                        722
#define PWM2CLKCON_CS0                723
#define PWM2CLKCON_CS                 724
#define PWM2CLKCON_CS1                725
#define PWM2CS1                       726
#define PWM2CLKCON_PS                 727
#define PWM2CLKCON_PS0                728
#define PWM2PS0                       729
#define PWM2PS                        730
#define PWM2PS1                       731
#define PWM2CLKCON_PS1                732
#define PWM2PS2                       733
#define PWM2CLKCON_PS2                734
#define PWM2LDCON                     735
#define PWM2LDCON_LDS0                736
#define PWM2LDS0                      737
#define PWM2LDCON_LDS                 738
#define PWM2LDS                       739
#define PWM2LDS1                      740
#define PWM2LDCON_LDS1                741
#define PWM2LDM                       742
#define PWM2LDCON_LDT                 743
#define PWM2LD                        744
#define PWM2LDCON_LDA                 745
#define PWM2OFCON                     746
#define PWM2OFS                       747
#define PWM2OFS0                      748
#define PWM2OFCON_OFS0                749
#define PWM2OFCON_OFS                 750
#define PWM2OFCON_OFS1                751
#define PWM2OFS1                      752
#define PWM2OFMC                      753
#define PWM2OFCON_OFO                 754
#define PWM2OFCON_OFM0                755
#define PWM2OFM                       756
#define PWM2OFCON_OFM                 757
#define PWM2OFM0                      758
#define PWM2OFCON_OFM1                759
#define PWM2OFM1                      760
#define PWM3PHL                       761
#define PWM3PHL_PH                    762
#define PWM3PHL0                      763
#define PWM3PHL1                      764
#define PWM3PHL2                      765
#define PWM3PHL3                      766
#define PWM3PHL4                      767
#define PWM3PHL5                      768
#define PWM3PHL6                      769
#define PWM3PHL7                      770
#define PWM3PHH0                      771
#define PWM3PHH                       772
#define PWM3PHH_PH                    773
#define PWM3PHH1                      774
#define PWM3PHH2                      775
#define PWM3PHH3                      776
#define PWM3PHH4                      777
#define PWM3PHH5                      778
#define PWM3PHH6                      779
#define PWM3PHH7                      780
#define PWM3DCL_DC                    781
#define PWM3DCL0                      782
#define PWM3DCL                       783
#define PWM3DCL1                      784
#define PWM3DCL2                      785
#define PWM3DCL3                      786
#define PWM3DCL4                      787
#define PWM3DCL5                      788
#define PWM3DCL6                      789
#define PWM3DCL7                      790
#define PWM3DCH_DC                    791
#define PWM3DCH0                      792
#define PWM3DCH                       793
#define PWM3DCH1                      794
#define PWM3DCH2                      795
#define PWM3DCH3                      796
#define PWM3DCH4                      797
#define PWM3DCH5                      798
#define PWM3DCH6                      799
#define PWM3DCH7                      800
#define PWM3PRL0                      801
#define PWM3PRL                       802
#define PWM3PRL_PR                    803
#define PWM3PRL1                      804
#define PWM3PRL2                      805
#define PWM3PRL3                      806
#define PWM3PRL4                      807
#define PWM3PRL5                      808
#define PWM3PRL6                      809
#define PWM3PRL7                      810
#define PWM3PRH0                      811
#define PWM3PRH_PR                    812
#define PWM3PRH                       813
#define PWM3PRH1                      814
#define PWM3PRH2                      815
#define PWM3PRH3                      816
#define PWM3PRH4                      817
#define PWM3PRH5                      818
#define PWM3PRH6                      819
#define PWM3PRH7                      820
#define PWM3OFL_OF                    821
#define PWM3OFL0                      822
#define PWM3OFL                       823
#define PWM3OFL1                      824
#define PWM3OFL2                      825
#define PWM3OFL3                      826
#define PWM3OFL4                      827
#define PWM3OFL5                      828
#define PWM3OFL6                      829
#define PWM3OFL7                      830
#define PWM3OFH_OF                    831
#define PWM3OFH0                      832
#define PWM3OFH                       833
#define PWM3OFH1                      834
#define PWM3OFH2                      835
#define PWM3OFH3                      836
#define PWM3OFH4                      837
#define PWM3OFH5                      838
#define PWM3OFH6                      839
#define PWM3OFH7                      840
#define PWM3TMRL0                     841
#define PWM3TMRL                      842
#define PWM3TMRL_TMR                  843
#define PWM3TMRL1                     844
#define PWM3TMRL2                     845
#define PWM3TMRL3                     846
#define PWM3TMRL4                     847
#define PWM3TMRL5                     848
#define PWM3TMRL6                     849
#define PWM3TMRL7                     850
#define PWM3TMRH0                     851
#define PWM3TMRH_TMR                  852
#define PWM3TMRH                      853
#define PWM3TMRH1                     854
#define PWM3TMRH2                     855
#define PWM3TMRH3                     856
#define PWM3TMRH4                     857
#define PWM3TMRH5                     858
#define PWM3TMRH6                     859
#define PWM3TMRH7                     860
#define PWM3CON                       861
#define PWM3CON_MODE0                 862
#define PWM3MODE                      863
#define PWM3CON_MODE                  864
#define PWM3MODE0                     865
#define PWM3CON_MODE1                 866
#define PWM3MODE1                     867
#define PWM3CON_POL                   868
#define PWM3POL                       869
#define PWM3CON_OUT                   870
#define PWM3OUT                       871
#define PWM3OE                        872
#define PWM3CON_OE                    873
#define PWM3EN                        874
#define PWM3CON_EN                    875
#define PWM3INTE                      876
#define PWM3PRIE                      877
#define PWM3INTE_PRIE                 878
#define PWM3INTE_DCIE                 879
#define PWM3DCIE                      880
#define PWM3PHIE                      881
#define PWM3INTE_PHIE                 882
#define PWM3INTE_OFIE                 883
#define PWM3OFIE                      884
#define PWM3INTF                      885
#define PWM3PRIF                      886
#define PWM3INTF_PRIF                 887
#define PWM3INTF_DCIF                 888
#define PWM3DCIF                      889
#define PWM3INTF_PHIF                 890
#define PWM3PHIF                      891
#define PWM3INTF_OFIF                 892
#define PWM3OFIF                      893
#define PWM3CLKCON                    894
#define PWM3CLKCON_CS                 895
#define PWM3CS                        896
#define PWM3CS0                       897
#define PWM3CLKCON_CS0                898
#define PWM3CS1                       899
#define PWM3CLKCON_CS1                900
#define PWM3PS0                       901
#define PWM3CLKCON_PS                 902
#define PWM3CLKCON_PS0                903
#define PWM3PS                        904
#define PWM3PS1                       905
#define PWM3CLKCON_PS1                906
#define PWM3PS2                       907
#define PWM3CLKCON_PS2                908
#define PWM3LDCON                     909
#define PWM3LDCON_LDS                 910
#define PWM3LDS0                      911
#define PWM3LDS                       912
#define PWM3LDCON_LDS0                913
#define PWM3LDS1                      914
#define PWM3LDCON_LDS1                915
#define PWM3LDCON_LDT                 916
#define PWM3LDM                       917
#define PWM3LDCON_LDA                 918
#define PWM3LD                        919
#define PWM3OFCON                     920
#define PWM3OFS                       921
#define PWM3OFCON_OFS0                922
#define PWM3OFS0                      923
#define PWM3OFCON_OFS                 924
#define PWM3OFCON_OFS1                925
#define PWM3OFS1                      926
#define PWM3OFMC                      927
#define PWM3OFCON_OFO                 928
#define PWM3OFM0                      929
#define PWM3OFCON_OFM0                930
#define PWM3OFCON_OFM                 931
#define PWM3OFM                       932
#define PWM3OFM1                      933
#define PWM3OFCON_OFM1                934
#define STATUS_SHAD                   935
#define C_SHAD                        936
#define DC_SHAD                       937
#define Z_SHAD                        938
#define WREG_SHAD                     939
#define BSR_SHAD                      940
#define PCLATH_SHAD                   941
#define FSR0L_SHAD                    942
#define FSR0H_SHAD                    943
#define FSR1L_SHAD                    944
#define FSR1H_SHAD                    945
#define STKPTR                        946
#define TOSL                          947
#define TOSH                          948

#endif // _PIC12F1572_H_
